In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.read_csv('abc.csv')

In [3]:
df

  student  language  science  maths  history
0   kumar        90       56     34       34
1   kevin        10       34     32       67
2   sammy        90       23     12       32
3  janice        20       67     90       45
4   peter        30       56     45       65
5    prem        90       45     45       34
6  carrol        50       90     45       23

In [4]:
df1 = pd.read_csv('abc.csv', skiprows=[1, 5, 7])

In [5]:
df1

  student  language  science  maths  history
0   kevin        10       34     32       67
1   sammy        90       23     12       32
2  janice        20       67     90       45
3    prem        90       45     45       34